Revit 2024 API
BuiltInFailures.EditingFailures.CannotDeleteEditedElementError Property
 Can't delete element that is being edited.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotDeleteEditedElementError { get; }
Visual Basic
Public Shared ReadOnly Property CannotDeleteEditedElementError As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotDeleteEditedElementError {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.EditingFailures Class
Autodesk.Revit.DB Namespace